const body1_card_data = [
    {
        img: './img/body1/img.png',
        title: '慢動作探索城市',
        text: '在這個市集中，將都市節奏的瘋狂轉化為慢動作的舞蹈,一切都仿佛進入了慢時光，放慢了速度，給予人們與自然和諧共處的寶貴時光',
    },
    {
        img: './img/body1/img2.png',
        title: '精彩藝術',
        text: '這裡的一切都如同慢動作電影一般，每一個瞬間都讓人難以忘懷。攤位上的藝術\
        品、手工藝品和珍貴的古董都值得細細品味',
    },
    {
        img: './img/body1/img3.png',
        title: '城市探索',
        text: '將你帶入這個城市的一個不同角度，你將發現\
        城市中隱藏的寶藏，走進不為人知的角落，探索古老和現代的融合',
    },
]

const mobile = ['歷史之旅', '城市大自然', '街頭藝術之旅', '多元文化探索']
const mobile_title = [
    {
        p: '第一週',
        title: '過去青春',
    },
    {
        p: '第二週',
        title: '水泥叢林',
    },
    {
        p: '第三週',
        title: '藝染之街',
    },
    {
        p: '第四週',
        title: '跨界新境',
    },
]
const mobile_card_data = {
    '歷史之旅': [
        {
            img: './img/body2/img.png',
            title: '飾品創作工作坊活動',
            text: '慢播市集提供不同時代風格的飾品創作工作坊，包括古典、文藝復興和近代風格',
        },
        {
            img: './img/body2/img2.png',
            title: '街坊美食之旅',
            text: '慢播小幫手擔當導覽團，帶領您參觀城市的歷史區域，並品味傳統的街坊小吃，\
            如古早味冰品和台中的老店糕餅',
        },
        {
            img: './img/body2/img3.png',
            title: '歷史故事講述表演',
            text: '我們將有專業的故事講述者為您呈現城市的歷史故事，\
            讓您沉浸在城市的過去，聆聽傳說和故事，感受歷史的魅力',
        },
        {
            img: './img/body2/img4.png',
            title: '歷史主題飾品',
            text: '創作以城市歷史事件、建築或人物為主題的飾品，\
            這些飾品可以包括刻有歷史細節的項鍊、胸針或手錶',
        },
    ],
    '城市大自然': [
        {
            img: './img/body2/img5.png',
            title: '自然元素的飾品',
            text: '舉辦植物養护和飾品創作工作坊，參與者可以製作帶有自然元素的飾品，如樹葉耳環和花朵項鍊',
        },
        {
            img: './img/body2/img6.png',
            title: '戶外美食體驗',
            text: '安排戶外野餐活動，提供當季的自然食材，如野菜、水果和野生草本植物',
        },
        {
            img: './img/body2/img7.png',
            title: '大自然音樂會',
            text: '您將享受到大自然音樂會的精彩表演，\
            音樂家們將以大自然為靈感，演奏美麗的音樂',
        },
        {
            img: './img/body2/img8.png',
            title: '多肉植物養護工作坊',
            text: '舉辦多肉植物養護工作坊，向參與者提供如何照顧和種植多肉植物的實用技巧',
        },
    ],
    '街頭藝術之旅': [
        {
            img: './img/body2/img9.png',
            title: '藝術家市集攤位',
            text: '邀請街頭藝術家現場創作藝術作品，您可以觀看他們的創作過程，並購買喜愛的藝術品',
        },
        {
            img: './img/body2/img10.png',
            title: '街頭美食小吃',
            text: '呈現不同家的街頭小吃，如西洋塔可、烤玉米、墨西哥捲餅等更有南洋風味特色咖哩與之較勁',
        },
        {
            img: './img/body2/img11.png',
            title: '街頭藝術表演',
            text: '街頭藝術家們將在舞台上進行現場表演，\
            這是一次近距離欣賞街頭藝術的絕佳機會，融入城市藝術的奇妙世界！',
        },
        {
            img: './img/body2/img12.png',
            title: '跨文化塗鴉牆',
            text: '設立一個大型的塗鴉牆，供參與者發揮創意，\
            創作屬於自己的街頭藝術作品。提供塗鴉噴漆和畫筆，讓您盡情表現',
        },
    ],
    '多元文化探索': [
        {
            img: './img/body2/img13.png',
            title: '國際小吃日',
            text: '慢播多個小吃攤位，代表不同國家的美食，並結合音樂和舞蹈表演，打造多元文化體驗',
        },
        {
            img: './img/body2/img14.png',
            title: '多元文化飾品',
            text: '展示代表不同文化的飾品設計，並邀請當地藝術家解釋其文化背景和設計靈感',
        },
        {
            img: './img/body2/img15.png',
            title: '多國舞蹈和音樂表演',
            text: '我們將呈現多國文化的舞蹈和音樂表演，展示不同國家的藝術風格，\
            感受來自世界各地的音樂和舞蹈帶來的多樣性',
        },
        {
            img: './img/body2/img16.png',
            title: '多元文化美食區域',
            text: '提供來自不同文化的美食和料理，包括素食選擇，\
            讓您能品味世界各地的風味',
        },
    ],
}
const body3_data = {
    '第一週': {
        date: '10月第一週',
        title: '歷史之旅',
        text: '將任您呈現欣賞和選購具有歷史價值和獨特風格的飾品，同時體驗城市\
        的多樣性歷史文化',
    },
    '6': {
        date: '6號(週五)',
        title: '「歷史之旅」歷史故事講述表演',
        text: '表演時間：晚上 7:00 - 9:00',
    },
    '7': {
        date: '7號(週六)',
        title: '「歷史之旅」歷史故事講述表演',
        text: '表演時間：上午 10:00 - 上午12:00',
    },
    '8': {
        date: '8號(週日)',
        title: '「歷史之旅」歷史故事講述表演',
        text: '表演時間：上午 10:00 - 上午12:00',
    },
    '第二週': {
        date: '10月第二週',
        title: '城市大自然',
        text: '設置適合植物愛好者和生態愛好者的您，同時豐\
        富了「城市大自然」的多樣性',
    }, 
    '14': {
        date: '14號(週六)',
        title: '大自然音樂會',
        text: '表演時間：上午 11:00 - 下午1:00',
    },
    '15': {
        date: '15號(週日)',
        title: '大自然音樂會',
        text: '表演時間：下午 3:00 - 下午5:00',
    },
    '第三週': {
        date: '10月第三週',
        title: '街頭藝術之旅',
        text: '展示當地和國際街頭藝術家的作品，包括塗鴉、塗鴉畫、街頭雕塑\
        等，供您瀏覽欣賞和購買藝術品。',
    },
    '20': {
        date: '15號(週五)',
        title: '街頭藝術表演',
        text: '表演時間：晚上 8:00 - 10:00',
    },
    '21': {
        date: '15號(週六)',
        title: '街頭藝術表演',
        text: '表演時間：下午 1:00 - 下午 3:00',
    },
    '22': {
        date: '22號(週日)',
        title: '街頭藝術表演',
        text: '表演時間：上午 11:00 - 上午 1:00',
    },
    '第四週': {
        date: '10月第四週',
        title: '多元文化探索',
        text: '本週主題區域強調多樣性、包容性和共融，同時，這些\
        商品和活動也可以提供支持性別平等和社會正義議題的方式',
    },
    '27': {
        date: '27號(週五)',
        title: '多國舞蹈和音樂表演',
        text: '表演時間：晚上 7:30 - 9:30 ',
    },
    '28': {
        date: '22號(週六)',
        title: '多國舞蹈和音樂表演',
        text: '表演時間：下午 3:30 - 下午5:30',
    },
    '29': {
        date: '29號(週日)',
        title: '多國舞蹈和音樂表演',
        text: '表演時間：下午 4:00 - 下午6:00（閉幕週的特別表演時段）',
    },
}
const body2_href = {
    '歷史之旅':'a.html',
    '城市大自然':'b.html',
    '街頭藝術之旅':'c.html',
    '多元文化探索':'d.html',
}
var mobile_click = '歷史之旅'
const body5_data = [
    {
        name: '陳小姐',
        email: 'qaz123456@gamil.com',
        text: '我覺得第一週的歷史之旅非常有趣，可以看到許多不同風格的飾品',
    },
    {
        name: '蔡先生',
        email: 'sec1235@gamil.com',
        text: '這個活動很有趣,尤其是大自然音樂會的精彩表演，音樂家們以大自然為靈感，演奏美麗的音樂，讓我感受到了大自然的和諧之美',
    },
    {
        name: '許先生',
        email: 'eff5820@gamil.com',
        text: '寶島慢播假日市集是一個會讓人想放慢動作的一個市集，還可以欣賞多國舞蹈和音樂表演，感受來自世界各地的音樂和舞蹈帶來的多樣性',
    },
]
const body6_btn = ['高鐵', '台鐵', '公車', '臺中I-bike鄰近站點', '自行開車']
const body6_data = {
    '高鐵': '臺中新烏日高鐵站下車，搭乘接駁車或火車至臺中火車站，再轉搭公車至<span class="color1 fw-bold">道禾六藝文化館</span>',
    '台鐵': '臺中火車站下車，可轉搭公車至<span class="color1 fw-bold">道禾六藝文化館</span>',
    '公車': '統聯客運 1. 臺中刑務所演武場 – 中臺科技大學校區<br>\
    台中客運 8. 臺中刑務所演武場 – 逢甲大學(逢甲路)<br>\
    台中客運 15. 臺中刑務所演武場 – 國軍臺中總醫院<br>\
    中鹿客運 21. 臺中刑務所演武場 – 三貴城<br>\
    <span class="color1 fw-bold f5">公車【道禾六藝文化館】下車</span><br><br>\
        台中客運 8. 臺中刑務所演武場 – 逢甲大學(逢甲路)<br>\
        台中客運 15. 臺中刑務所演武場 – 國軍臺中總醫院<br>\
        豐原客運 51. 莒光新城 – 圓山新村<br>\
        豐原客運 55. 地方法院 – 豐原<br>\
        台中客運 71. 臺中洲際棒球場 – 植物園(西屯路)<br>\
        統聯客運 75. 臺中榮總 – 一江橋<br>\
        豐原客運 202. 豐富公園 – 豐原(經樹德路)<br>\
        豐原客運 203. 豐富公園 – 豐原(經新田)<br>\
        豐原客運 270. 豐富公園 – 東勢(經大南)<br>\
        豐原客運 271. 豐富公園 – 東勢(經東興)<br>\
        豐原客運 276. 豐富公園 – 東勢(經興中山莊)<br>\
        豐原客運 277. 豐富公園 – 東勢(經復盛里)<br>\
        <span class="color1 fw-bold f5">公車 【地方法院】下車，步行約五分鐘至道禾六藝文化館</span>',
    '臺中I-bike鄰近站點': '中山地政事務所-三民路一段/三民路一段 156 巷口<br>\
                            公館公園-三民路一段/自由路一段口<br>\
                            臺中女中-自由路一段/康樂街口<br>\
                            復興停車場-復興路三段/國光路口',
    '自行開車': '<span class="color1 fw-bold">南下</span><br>\
    中山五權交流道>>五權西路>>五權路>>林森路>>府後街口(園區旁\
    備有大型公有停車場)<br>\
    <br>\
    <span class="color1 fw-bold">北上</span><br>\
    中港交流道>>台灣大道>>英才路>>林森路>>府後街口(園區旁備有\
    大型公有停車場)',
}
var body6_click = '高鐵'

const robot_data = {
    '關於我們': {
        url: 'body1',
        text: '在這個數位浪潮的後疫情時代，我們為「躺平」的生活節奏而打造㇐個令人期待的市集活動-「寶島慢播假日市集」，\
    讓人們能夠輕鬆探索市集淺讀、當地的相關文化活動、藝術展示和音樂表演',
    },
    '每週主題': {
        url: 'body2',
        text: '10月份的每週將有不同的活動期間主題，讓大家體驗到不同類型的活動',
    },
    '主題特色': {
        url: 'body4',
        text: '每週都將有各個主題的不同特色，讓大家享受不同特色的主題活動',
    },
}